
// Напишіть функцію, яка буде приймати число і визначати:
//   Чи являється воно додатнім чи від’ємним?
//   Чи являється воно простим?
//   Чи ділиться воно на 2,5,3,6,9 без остачі?


// Чи являється воно додатнім чи від’ємним?
function qw(a){
  if (+a >0){
    return "ДОдатнє";
  } else if (+a <0) {
    return "від’ємнe";
  } else {
    return "0";
  }
}

// Чи являється воно простим?
var d = 1000;
function qwe(a){
  if(a==1) // 1 - не простое число
  		return "ne являється воно простим";
  	// перебираем возможные делители от 2 до sqrt(n)
  	for(d=2; d*d<=a; d++){
  		// если разделилось нацело, то составное
  		if(a%d==0)
  			return "ne являється воно простим";
  		}
  	// если нет нетривиальных делителей, то простое
  	return "являється воно простим";
  	}

    //  Чи ділиться воно на 2,5,3,6,9 без остачі?
function qwer(a){
  if (a%2==0){
    return "ділиться на 2 без остачі";
  } else if (a%5==0) {
    return "ділиться на 5 без остачі";
  }
  else if (a%3==0) {
    return "ділиться на 3 без остачі";
  } else if (a%6==0) {
    return "ділиться на 6 без остачі";
  } else if (a%9==0) {
    return "ділиться на 9 без остачі";
  } else {
    return "ne ділиться на 2,5,3,6,9 без остачі";
  }
}

var x = prompt("x = ",1);
alert (qw(x));
alert (qwe(x));
alert (qwer(x));
