// Сделать свою утилиту-калькулятор,
// которая будет вычислять те или иные функции
 // (например, квадрат числа, корень квадратный и т.д.),
  // применив разную реализацию функций. Как вариант -
  // сделать кнопочки с рассмотреным на предыдущем занятии
  //  простейшым обработчиком событий .onclick ().

// plus.onclick= alert( 'Спасибо' );
  // };document.write(+);
// document.write(b);

// Callback
// function chooseFunc(doOperation){
//   doOperation();
// }
// при натисненні на кнопку виконується операція
  // chooseFunc(f);
